* TODO Todo and time for Francis

** TODO Make request_processor work
   CLOCK: [2011-03-04 Fri 14:23]--[2011-03-04 Fri 14:43] =>  0:20

** TODO BLOG - Faire Fonctionner le blog avec les nouveau menu
*** DONE Page generic du blog
    CLOSED: [2011-03-28 Mon 01:04]
*** DONE Pagination
    CLOSED: [2011-03-28 Mon 01:03]
*** DONE Page specifique de blog
    CLOSED: [2011-03-30 Wed 22:08]
*** DONE Archive
    CLOSED: [2011-03-28 Mon 01:04]
    CLOCK: [2011-03-27 Sun 19:33]--[2011-03-28 Mon 01:01] => 5:28  
*** DONE Categorie
    CLOSED: [2011-03-28 Mon 01:00]
*** TODO Remove classic hardcode in blog archives
*** TODO Refactor html_navigation for code reuse
*** TODO Make template tag or widget for blog navigation
*** DONE Widget Point to new urls
    CLOSED: [2011-03-30 Wed 23:55]
**** DONE Short
     CLOSED: [2011-03-30 Wed 23:55]
     CLOCK: [2011-03-30 Wed 22:09]--[2011-03-30 Wed 23:54] =>  1:45
**** DONE Long
     CLOSED: [2011-03-30 Wed 23:55]
     CLOCK: [2011-03-30 Wed 23:54]--[2011-03-30 Wed 23:55] =>  0:01

** TODO Search
*** DONE [#B] bug in www/models/page.py can return empty list
    CLOSED: [2011-04-11 Mon 20:21]
    CLOCK: [2011-04-11 Mon 20:16]--[2011-04-11 Mon 20:20] =>  0:04
*** TODO [#B] search should be reindex at every save call
*** TODO [#C] Make application for configuration
*** DONE Change logic in container to get page url
    CLOSED: [2011-04-12 Tue 22:31]
    CLOCK: [2011-04-12 Tue 21:19]--[2011-04-12 Tue 22:31] =>  1:12
 
#+BEGIN: clocktable :maxlevel 2 :scope file
Clock summary at [2011-04-11 Mon 20:23]

|Headline|Time|
|-
|*Total time*| *7:38*|
|-
|TODO Todo and time for Francis|7:38|
|TODO Make request_processor work||0:20|
|TODO BLOG - Faire Fonctionner le blog avec les nouveau menu||7:14|
|TODO Search||0:04|
#+END:
